app/views/comments/_show_comments.html.erb

<h3> <%= @post.title %> comments </h3>
<% @post.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 29]]