app/views/comments/index.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 27]]
---
<h3> <%= @post.title %> comments </h3>
<% @post.comments.each do |comment| %>