app/views/posts/_property_details.html.erb

SELECT  1 AS one FROM "properties" WHERE "properties"."post_id" = ? LIMIT ?  [["post_id", 31], ["LIMIT", 1]]
SELECT "properties".* FROM "properties" WHERE "properties"."post_id" = ?  [["post_id", 31]]
---
<% if !@post.properties.empty? %>