app/views/posts/new.html.erb


<%= post_builder.collection_check_boxes(:property_ids, Property.all, :id, :name) %>
---
SELECT "properties".* FROM "properties"