app/views/posts/show.html.erb

<h3>comments</h3>
<% @post.comments.each do |comment| %>
---
SELECT  "comments".* FROM "comments" WHERE "comments"."post_id" = ? ORDER BY "comments"."id" DESC LIMIT ?  [["post_id", 1], ["LIMIT", 1]]