app/controllers/comments_controller.rb

  def index
    @post = Post.find(params[:post_id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 27], ["LIMIT", 1]]

  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.create(content: params[:comment][:content], commenter: params[:comment][:commenter], post_id: @post.id, user_id: current_user.id)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
INSERT INTO "comments" ("user_id", "post_id", "content", "commenter") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["post_id", 1], ["content", "Great first post"], ["commenter", "Donald"]]