app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"
---
  def index
    if !!current_user
      @posts = Post.all

INSERT INTO "posts" ("title", "content") VALUES (?, ?)  [["title", ""], ["content", ""]]
UPDATE "users" SET "post_count" = ? WHERE "users"."id" = ?  [["post_count", 1], ["id", 3]]
---
  def create
    @post = Post.new(post_params)
    if @post.valid?
      @post.user_id = current_user.id
      current_user.post_count += 1
      current_user.save

UPDATE "posts" SET "content" = ? WHERE "posts"."id" = ?  [["content", "HERE'S HOW TO REHAB IF YOUR A NOOB: Go to home depot, hire a contractor. Pay him money. Look up a licensed ones, cuz this post is edited!!!"], ["id", 3]]
---
  def update
    @post = current_post
    @post.update(post_params)

DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 20]]
---
  def destroy
    @post = current_post
    @post.destroy